//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2022, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleFruSetup.uni
// [Description] String definitions for the FRU setup screen
// [Author] David Zhao
// [Date] 20201221
//******************************************************************************

#langdef   en-US "English"    // English
#langdef   zh-chs "中文 (简体)" // Chinese simplified

//XCradle-LZQ20230404V001-Add-Start

#string STR_SRVRMGMT_FRU_FORM_TITLE     #language en-US  "FRU Information"
                                        #language zh-chs "FRU信息"
#string STR_SRVRMGMT_FRU_FORM_HELP      #language en-US  "Examine Field Replaceable Units (FRU) parameters."

#string STR_SRVRMGMT_FRU_VIEW           #language en-US  "View FRU Information"
                                        #language zh-chs "查看FRU信息"
#string STR_SRVRMGMT_FRU_VIEW_HELP      #language en-US  "Press <Enter> to view FRU information."
                                        #language zh-chs "按回车键查看FRU信息"

#string STR_SYS_MANUFACTURER            #language en-US  "Product Manufacturer"
                                        #language zh-chs "产品制造商"
#string STR_SYS_MANUFACTURER_VAL        #language en-US  "-"
#string STR_SYS_MANUFACTURER_HELP       #language en-US  "Product Manufacturer"
                                        #language zh-chs "产品制造商"//XCradle-FZH20231120V001-Add

#string STR_SYS_PROD_NAME               #language en-US  "Product Name"
                                        #language zh-chs "产品名称"
#string STR_SYS_PROD_NAME_VAL           #language en-US  "-"
#string STR_SYS_PROD_NAME_HELP          #language en-US  "Product Name"
                                        #language zh-chs "产品名称"


#string STR_SYS_PROD_PART_NUM           #language en-US  "Product Part Number"
                                        #language zh-chs "产品料号"
#string STR_SYS_PROD_PART_NUM_VAL       #language en-US  "-"
#string STR_SYS_PROD_PART_NUM_HELP      #language en-US  "Product Part Number"
                                        #language zh-chs "产品料号"

#string STR_SYS_VERSION                 #language en-US  "Product Version"
                                        #language zh-chs "产品版本"
#string STR_SYS_VERSION_VAL             #language en-US  "-"
#string STR_SYS_VERSION_HELP            #language en-US  "Product Version"
                                        #language zh-chs "产品版本"

#string STR_SYS_SERIAL_NUM              #language en-US  "Product Serial"
                                        #language zh-chs "产品序列号"
#string STR_SYS_SERIAL_NUM_VAL          #language en-US  "-"
#string STR_SYS_SERIAL_NUM_HELP         #language en-US  "Product Serial Number"
                                        #language zh-chs "产品序列号"

#string STR_SYS_ASSERT_TAG              #language en-US  "Product Asset Tag"
                                        #language zh-chs "产品资产编码"
#string STR_SYS_ASSERT_TAG_VAL          #language en-US  "-"
#string STR_SYS_ASSERT_TAG_HELP         #language en-US  "Product Asset Tag"
                                        #language zh-chs "产品资产编码"

#string STR_BRD_MANUFACTURER            #language en-US  "Board Mfg"
                                        #language zh-chs "主板制造商"
#string STR_BRD_MANUFACTURER_VAL        #language en-US  "-"
#string STR_BRD_MANUFACTURER_HELP       #language en-US  "Board Manufacturer"
                                        #language zh-chs "主板制造商"

#string STR_BRD_PROD_NAME               #language en-US  "Board Product"
                                        #language zh-chs "主板产品名称"
#string STR_BRD_PROD_NAME_VAL           #language en-US  "-"
#string STR_BRD_PROD_NAME_HELP          #language en-US  "Board Product Name"
                                        #language zh-chs "主板产品名称"

#string STR_BRD_VERSION                 #language en-US  "Board Version"
                                        #language zh-chs "主板版本"
#string STR_BRD_VERSION_VAL             #language en-US  "-"
#string STR_BRD_VERSION_HELP            #language en-US  "Board Version"
                                        #language zh-chs "主板版本"

#string STR_BRD_SERIAL_NUM              #language en-US  "Board Serial"
                                        #language zh-chs "主板序列号"
#string STR_BRD_SERIAL_NUM_VAL          #language en-US  "-"
#string STR_BRD_SERIAL_NUM_HELP         #language en-US  "Board Serial Number"
                                        #language zh-chs "主板序列号"

#string STR_BRD_PART_NUM                #language en-US  "Board Part Number"
                                        #language zh-chs "主板料号"
#string STR_BRD_PART_NUM_VAL            #language en-US  "-"
#string STR_BRD_PART_NUM_HELP           #language en-US  "Board Part Number"
                                        #language zh-chs "主板料号"

#string STR_CHA_MANUFACTURER            #language en-US  "Chassis Manufacturer"
                                        #language zh-chs "机箱制造商"
#string STR_CHA_MANUFACTURER_VAL        #language en-US  "-"
#string STR_CHA_MANUFACTURER_HELP       #language en-US  "Chassis Manufacturer"
                                        #language zh-chs "机箱制造商"

#string STR_CHA_TYPE                    #language en-US  "Chassis Type"
                                        #language zh-chs "机箱类型"
#string STR_CHA_TYPE_VAL                #language en-US  "-"
#string STR_CHA_TYPE_HELP               #language en-US  "Chassis Type"
                                        #language zh-chs "机箱类型"

#string STR_CHA_PART_NUM                #language en-US  "Chassis Part Number"
                                        #language zh-chs "机箱料号"
#string STR_CHA_PART_NUM_VAL            #language en-US  "-"
#string STR_CHA_PART_NUM_HELP           #language en-US  "Chassis Part Number"
                                        #language zh-chs "机箱料号"

#string STR_CHA_SERIAL_NUM              #language en-US  "Chassis Serial"
                                        #language zh-chs "机箱序列号"
#string STR_CHA_SERIAL_NUM_VAL          #language en-US  "-"
#string STR_CHA_SERIAL_NUM_HELP         #language en-US  "Chassis Serial Number"
                                        #language zh-chs "机箱序列号"

#string STR_CHA_VERSION                 #language en-US  "Chassis Version"
                                        #language zh-chs "机箱版本"
#string STR_CHA_VERSION_VAL             #language en-US  "-"
#string STR_CHA_VERSION_HELP            #language en-US  "Chassis Version"
                                        #language zh-chs "机箱版本"

#string STR_SYSTEM_UUID                 #language en-US  "System UUID"
                                        #language zh-chs "系统UUID"
#string STR_SYSTEM_UUID_HELP            #language en-US  "System Unique ID."
                                        #language zh-chs "系统UUID"
#string STR_SYSTEM_UUID_VAL             #language en-US  "-"

#string STR_NULL_STRING                 #language en-US  ""
//XCradle-LZQ20230404V001-Add-End
//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2022, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************
